In [12]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns
from sklearn.cluster import KMeans

Load Dataset

In [13]:
df = pd.read_csv('Mall_Customers .csv')

Data Understanding

In [14]:
df.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [16]:
df.shape

(200, 5)

In [17]:
df.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [18]:
df.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

Data Cleaning and Preprocessing

In [19]:
df.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [20]:
# df=pd.get_dummies(df,columns=['Gender'])

In [21]:
# gender_dummies = pd.get_dummies(df['Gender'])
# df = pd.concat([df, gender_dummies], axis=1)
# df.drop('Gender', axis=1, inplace=True)

In [22]:
#Onehot Encoding
from sklearn.preprocessing import OneHotEncoder

#Initialize OneHotEncoder
onehot_encoder=OneHotEncoder(sparse_output=False) #sparse=False â†’ returns a dense array suitable for Pandas.

# Fit and transform the Gender column
gender_encoded=onehot_encoder.fit_transform(df[['Gender']])

# Convert to DataFrame with column names
gender_df = pd.DataFrame(gender_encoded, columns=onehot_encoder.get_feature_names_out(['Gender']))

# Concatenate with original DataFrame and drop original column
df = pd.concat([df.drop('Gender', axis=1), gender_df], axis=1)

Exploratory Data Analysis(EDA)